// pocketbase_instance.dart
import 'package:pocketbase/pocketbase.dart';

// --- هام جداً ---
// العنوان '10.0.2.2' هو عنوان خاص للوصول إلى جهاز الكمبيوتر (localhost)
// من داخل محاكي أندرويد الرسمي.
// لا تقم بتغييره إلى '127.0.0.1'.

// إذا كنت تستخدم هاتفًا حقيقيًا للتجربة، يجب عليك:
// 1. التأكد من أن الهاتف والكمبيوتر على نفس شبكة الـ Wi-Fi.
// 2. استبدال '10.0.2.2' بعنوان IP الخاص بجهاز الكمبيوتر على الشبكة (مثل 192.168.1.5).

// تأكد أيضًا من تشغيل PocketBase باستخدام الأمر التالي للسماح بالاتصالات الخارجية:
// .\pocketbase.exe serve --http="0.0.0.0:8090"

final pb = PocketBase('https://area-components-diego-query.trycloudflare.com');
